Tekla.Structures.Drawing.DetailMarkTagsAttributes
The DetailMarkTagsAttributes class contains attributes for detail mark tags.

Tekla.Structures.Drawing.DetailMarkTagsAttributes.TagA1
The tag A1 of a mark.

Tekla.Structures.Drawing.DetailMarkTagsAttributes.TagA2
The tag A2 of a mark.

Tekla.Structures.Drawing.DetailMarkTagsAttributes.TagA3
The tag A3 of a mark.

Tekla.Structures.Drawing.DetailMarkTagsAttributes.TagA4
The tag A4 of a mark.

Tekla.Structures.Drawing.DetailMarkTagsAttributes.TagA5
The tag A5 of a mark.

Tekla.Structures.Drawing.DetailMarkTagsAttributes.#ctor
Creates a new mark tags attributes instance.

Tekla.Structures.Drawing.DetailMarkTagsAttributes.#ctor(Tekla.Structures.Drawing.ViewMarkBasicTagAttributes,Tekla.Structures.Drawing.ViewMarkBasicTagAttributes,Tekla.Structures.Drawing.ViewMarkBasicTagAttributes,Tekla.Structures.Drawing.ViewMarkBasicTagAttributes,Tekla.Structures.Drawing.ViewMarkBasicTagAttributes)
Creates a new mark tags attributes instance.
tagA1: The tag at place A1.
tagA2: The tag at place A2.
tagA3: The tag at place A3.
tagA4: The tag at place A4.
tagA5: The tag at place A5.

Tekla.Structures.Drawing.DetailMarkTagsAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.